source/_posts/person/richard-hamming/richard-hamming.org
#+title: richard hamming

* learning to learn

*** [note] thinking machine

    - AI is about building thinking machine
      we need to ask what is "thinking"

    - "to think is to fix belief"
      when talking about thinking machine
      we can use peirce's definition of thinking
1
    - we can further ask what is "belief"
      TODO

    - we can also ask what is "alive"
      TODO

* (1962) numerical methods for scientists and engineers

* (1971) introduction to applied numerical analysis
