out/person/richard-hamming/richard-hamming.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>person/richard-hamming/richard-hamming.org</title>
</head>
<body>
<pre style="white-space: pre-wrap;">#+title: richard hamming

* learning to learn

*** [note] thinking machine

    - AI is about building thinking machine
      we need to ask what is &quot;thinking&quot;

    - &quot;to think is to fix belief&quot;
      when talking about thinking machine
      we can use peirce&apos;s definition of thinking
1
    - we can further ask what is &quot;belief&quot;
      TODO

    - we can also ask what is &quot;alive&quot;
      TODO

* (1962) numerical methods for scientists and engineers

* (1971) introduction to applied numerical analysis
</pre>
</body>
</html>
